{
  "projects": [
    
    {
      "name": "Content-Based Image Retrieval",
      "description": "This project explores the concept of matching images by specific features such as color, texture, image section, or using deep networks. It also introduces different distance metrics to compare 2 images of different colors, textures, etc, such as histogram intersection. When looking at matching images by features it's important to understand which features are of interest to match to other images, thus combining and weighing different or similar features can be helpful to achieve the desired result.",
      "date": "May 2024",
      "ieee": "",
      "live": "",
      "github": "",
      "report": "https://drive.google.com/file/d/1bxmgPQXGWOioHoGkAmJCU9crCmD2XjIh/view",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["cv"],
      "summary": "Feature-based image matching using color, texture, regions, and deep features; compares images with metrics like histogram intersection."
    },
    {
      "name": "Real-time 2D Object Recognition",
      "description": "This project introduces methods to compare image frames within a video sequence for object recognition. We use region-based object recognition methods such as moments, percent fill, etc to compare objects. The program takes a training database of at least 5 objects of multiple points to then compare to new objects (known or unknown), if the objects are known the system will classify the object. With comparison, multiple distance metrics can be used to compare objects, such as L2 distance and KNN classification, which we will use in this project.",
      "date": "Feb 2024",
      "ieee": "",
      "live": "",
      "github": "https://github.com/U-Abhishek/Real-time-2D-object-detection",
      "report": "https://drive.google.com/file/d/1CPJmNOlbd0gZSQDC1_rxCFZbUmbiTfSl/view",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["cv"],
      "summary": "Region-based object recognition in video using moments, percent fill, and KNN/L2 metrics with a small training database."
    },
    {
      "name": "Calorie-Counter",
      "description": "This project provides an interface to track food and calories per day with a scale supplied by the user. Foods included in our database include: Cheesecake, tacos, scallops, pizza, pho, donuts, pancake, spaghetti, strawberry, and bananas.",
      "date": "March 2024",
      "ieee": "",
      "live": "",
      "github": "https://github.com/U-Abhishek/Calorie-Counter",
      "report": "",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["cv"],
      "summary": "Simple interface to track daily foods and calories with a user-supplied scale."
    },
    {
      "name": "Road Surface Segmentation",
      "description": "Road surface segmentation is a crucial aspect of self-driving cars, autonomous robots, and advanced driving assistant systems, which attracted much research attention to this topic. Deep learning models are being developed with the availability of large road segmentation datasets. However, the diversity of data obtainable is finite and it is not transparent to what degree techniques generalize beyond the explicit datasets they were trained on. In this paper, we propose a novel training process to improve the cross-dataset performance of road segmentation systems by forcing the model to learn features that are highly relevant to the output required.",
      "date": "Feb 2022",
      "ieee": "",
      "live": "",
      "github": "https://github.com/U-Abhishek/Road-Segmentation",
      "report": "https://drive.google.com/file/d/1RhgZgy-aXfWRKdqMsXR65-mGC_Br-2no/view",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["cv"],
      "summary": "Training strategy to improve cross-dataset generalization for road surface segmentation using deep learning."
    },
    {
      "name": "Customized Region Proposal based Traffic Sign Detection",
      "description": "In the present work, traffic signs were recognized by a deep neural network architecture from a camera image. The customized object proposal method is proposed to localize the region of interest. The number of regions generated by the proposed method is five times fewer than selective search segmentation, this makes the process faster than selective search segmentation as the time spent on false regions proposed by selective search is saved. The proposed method is computationally efficient and simple as compared to modern faster regional convolutional neural networks, where Convolutional layers (RPN) are embedded in the network to determine the region of interest. The proposed system can be utilized for developing a smart driver-assistant system and self-driving cars.",
      "date": "July 2021",
      "ieee": "https://ieeexplore.ieee.org/document/9850716",
      "live": "",
      "github": "https://github.com/U-Abhishek/Region-Proposal-For-Traffic-Sign-Detection",
      "report": "",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["cv"],
      "summary": "Lightweight traffic sign detection using a custom region proposal method that reduces proposals vs. selective search."
    },
    {
      "name": "Leo Explore: The Reconnaissance Bot",
      "description": "The Reconnaissance Bot is an advanced autonomous navigation system designed to explore and map unknown environments. Utilizing a sophisticated navigation stack based on frontier exploration, it integrates Simultaneous Localization and Mapping (SLAM) to gather essential spatial information. The system consists of three key modules: the Frontier Server, which uses K-means clustering to identify unexplored regions; the Global Planner, which optimizes paths using an adapted A-star algorithm; and the Local Planner, employing a Model Predictive Path Integral (MPPI) method for obstacle-aware motion. Motivated by the need for autonomous systems to safely navigate hazardous or inaccessible areas, the Reconnaissance Bot has been successfully tested on the TurtleBot3 Burger platform, showcasing its potential for real-world applications such as disaster response and military reconnaissance.",
      "date": "April 2024",
      "ieee": "",
      "live": "",
      "github": "https://github.com/U-Abhishek/Leo_explore",
      "report": "https://drive.google.com/file/d/1-959kS4BxK7TbUYK5-S4CK7VB4_yWfh2/view",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "https://www.youtube.com/watch?v=fyIsYrZ6wks&list=TLGG8CfmGmJbyOgyNDA5MjAyNQ&t=50s",
      "tags": ["robotics"],
      "summary": "Autonomous frontier-exploration stack (SLAM, K-means frontiering, adapted A*, MPPI) validated on TurtleBot3."
    },
    {
      "name": "Mapping Boston Streets using an Autonomous Car",
      "description": "This project aims to create a detailed point cloud map of selected streets in Boston using the LEGO-LOAM SLAM (Simultaneous Localization and Mapping) algorithm on the NUANCE autonomous vehicle. To accommodate the specific conditions and data collected during our mapping runs, the standard LEGO-LOAM system was modified and optimized for our dataset. LEGO-LOAM is a lightweight and computationally efficient LiDAR-based odometry and mapping system designed for ground-based autonomous vehicles in ROS environments. In this implementation, the system processes point cloud data from a Velodyne VLP-16 LiDAR sensor and produces real-time 6-degree-of-freedom pose estimation. For this project, data was collected on various streets in Boston using the NUANCE vehicle equipped with multiple sensors and recorded in Rosbag format.",
      "date": "dec 2023",
      "ieee": "",
      "live": "",
      "github": "https://github.com/U-Abhishek/mapping_boston_streets",
      "report": "",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["robotics"],
      "summary": "Urban LiDAR mapping with LEGO-LOAM on NUANCE vehicle; optimized pipeline for our dataset."
    },
    {
      "name": "Optimizing Autonomous Vehicle Positioning Using IMU and GPS",
      "description": "This project focuses on analyzing data collected from the NUANCE autonomous vehicle, equipped with an Inertial Measurement Unit (IMU) and GPS sensors, during stationary and moving states on Northeastern University's campus. The primary goal is to assess vehicle position, orientation, and forward velocity using sensor fusion techniques.",
      "date": "Nov 2023",
      "ieee": "",
      "live": "",
      "github": "",
      "report": "https://drive.google.com/file/d/1uXPaIb9RzE0dKg7XVhpmjyoVX1k5qCPO/view",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["robotics"],
      "summary": "Sensor fusion analysis of IMU and GPS to estimate pose and velocity on campus runs."
    },
    {
      "name": "Comparison of Conventional and Intelligent MPPT Implementation using Boost Converter",
      "description": "A comparative analysis of traditional Perturb & Observe and ANN-based MPPT for solar PV systems, showcasing improved tracking efficiency and stability under varying conditions with intelligent MPPT.",
      "date": "march 2022",
      "ieee": "https://ieeexplore.ieee.org/document/9909115",
      "live": "",
      "github": "",
      "report": "",
      "image": "https://images.unsplash.com/photo-1504608524841-42fe6f032b4b?w=500&h=300&fit=crop",
      "youtube": "",
      "tags": ["ml"],
      "summary": "Comparison of P&O and ANN-based MPPT on a boost converter for improved tracking and stability."
    }
  ]
}
